# zip函数用于打包元素
# zip() 函数用于将可迭代的对象作为参数，
# 将对象中对应的元素打包成一个个元组，然后返回由这些元组组成的列表
# >>>a = [1,2,3]
# >>> b = [4,5,6]
# >>> zipped = zip(a,b)  打包为元组的列表
# [(1, 4), (2, 5), (3, 6)]


# 1 构建字典的 2 个列表相同
a = [1, 2, 3, 4]
b = ['ab', 'ac', 'ad']
d1 = dict(zip(a, b))
print(d1)
# {1: 'ab', 2: 'ac', 3: 'ad'}


# 2 构建字典的 2 个列表不同（key比value多）

a = [1, 2, 3, 4]
c = ['aa', 'ss']
d2 = dict(zip(a, c))
print(d2)
# {1: 'aa', 2: 'ss'}


# 3 构建字典的 2 个列表不同（key比value少）
a = [1, 2, 3, 4]
d = ['fa', 'fb', 'fc', 'fd', 'fe']
d3 = dict(zip(a, d))
print(d3)
# {1: 'fa', 2: 'fb', 3: 'fc', 4: 'fd'}

# 4 生成前后元素生成一个字典
l = ['a', 'b', 'c', 'd', 'e','f']
l1 = list(zip(l[:-1],l[1:]))
print(l1)
print(dict(l1))
# [('a', 'b'), ('b', 'c'), ('c', 'd'), ('d', 'e'), ('e', 'f')]
# {'a': 'b', 'b': 'c', 'c': 'd', 'd': 'e', 'e': 'f'}